{
    "recipes": [
       {
            "name":"Neapolatin Pizza",
            "serving":{
                "quantity": 4,
                "size": 200,
                "unit":"Gram",
                "type": "Dough Balls"
            },
            "description":"Tasty, chewy and crispy is what we all need.<br><i>'Theres no such thing as a bad pizza'</i> 🍕🥴🤣<br>Whether you believe in this <strong>myth</strong> or not... <br> Making the <i>perfect</i> pizza is a bit tricky...<br>It starts with a 500-950°F oven and this recipe!<br>Recipe credits go to the Ooni test kitchen!",
            "ingredients":[
                {
                    "name":"'00' Flour",
                    "quantity":500,
                    "unit":"Grams"
                },
                {
                    "name":"Water",
                    "quantity":300,
                    "unit":"mL"
                },
                {
                    "name":"Salt",
                    "quantity":10,
                    "unit":"Grams"
                },
                {
                    "name":"Instant Yeast",
                    "quantity":1.12,
                    "unit":"Grams"
                }
            ], 
            "instructions":[
                "Prepare warm water (bring 1\/3 of your water to a boil and mix with remaining water)",
                "When the whater is lukewarm, add your yeast and salt",
                "Add this mixture into a large mixing bowl and knead for 10 min",
                "Cover dough with plastic wrap and/or damp kitchen towel and leave to rise for 2hrs",
                "Once dough has roughly doubled in size, split the dough balls up into roughly 240g balls for a 10-12 inch pizza",
                "Roll divided dough into round balls and let rest (covered) for 15 - 20 minutes",
                "Flatten it out with your fingers, starting in the center pushing the tiny little gas bubbles towards a 1-2 cm crust",
                "At this point it is a subjective free for all... Sauce it up with tomatoe, alfredo or even BBQ base and add your desired toppings!",
                "My philosophy is the simpler the pizza the better... ENJOY!"
            ],
            "SpecialNotes":"Hey this note is very special",
            "photoThumbnail":"recipePhotos/CookedDough.jpeg",
            "photoHeader":"recipePhotos/HighQaulityDoughPhotoRev1.jpg"
       },
       {
            "name":"Lebanese Garlic Sauce",
            "serving":{
                "quantity": 5,
                "size":"",
                "unit":"Cups",
                "type": "Fluffy Garlic Sauce"
            },
            "description":"About 4 years ago I was introduced...<br>I've been making it almost monthly ever since.<br>I've travelled <i><strong>far</strong></i> around the Middle-East...<br>And by <i><strong>far</strong></i>, it's the most simple and tasty.<br>Let me know what you try it on!<br>My favourites are on chicken and pizza 🤤<br>Recipe credit go to the beautiful Lody!",
            "ingredients": [
                {
                    "name" : "Fresh Garlic Cloves",
                    "quantity" : 1,
                    "unit" : "Cups"
                },
                {
                    "name" : "Any Vegetable Oil",
                    "quantity" : 2.5,
                    "unit" : "Cups"
                },
                {
                    "name" : "Fresh Lemon Juice",
                    "quantity" : 3,
                    "unit" : "Lemons"
                },
                {
                    "name" : "Salt",
                    "quantity" : 4,
                    "unit" : "tsp"
                }
            ],
            "instructions":[
                "Squeeze the lemons, collect the juice in a bowl and cut the brown ends off your garlic cloves",
                "Using a food processer <strong>with</strong> a feed tube, pulse your garlic until most pieces are stuck on the walls, then scrape down",
                "<i>Ok so at this point you need to have all your ingredients ready because when we turn on the processor it should not turn off until we are done.<br> We want to emulsify the oil and garlic together and that can only be done by SLOWLY adding in the oil. Most food processors come with a small hole <br> in the feedtube for this process, if you dont have it no worries, pour the oil as thin as a fine thread</i>",
                "We will add in our oil in batches of 1\/3 cups. So go a head, and add a little oil and then turn on the machine",
                "Once the 1\/3 of a cup of oil has been incorperated, add 1-2 tsp of the lemon juice - Repeat this stip until all the oil is incorperated",
                "Finally turn off your machine, and add your salt to taste. If you find the garlic too 'spicy'😭 add 1\/2 - 1 cup of more oil next time",
                "Because of the simple ingredients, the sauce will last over a month in the fridge! Enjoy your garlic breath my friends! 😮‍💨💀"
                
            ],
            "SpecialNotes":"Hey this note is very special",
            "photoThumbnail": "recipePhotos/GarlicSauceThumbnail.jpg",
            "photoHeader": "recipePhotos/GarlicSauceHeaderRev1.jpg"
        },
        {
            "name":"Pita bread",
            "serving":{
                "quantity": 8,
                "size": 6,
                "unit":"Inch",
                "type": "Pita"
            },
            "description":"Not much beats fresh bread...<br>Expecially when you make it yourself!<br>The perfect pita pocket recipe is here!<br>Rip it and dip it or turn it into a utensil. 😎<br>Pair with hummus, babaghanoush or Lebnah.<br>Shawarma wraps with my Garlic Sauce...😍<br>Recipe credits go to David at the NY Times!",
            "ingredients": [
                {
                    "name": "All-purpose Flour",
                    "quantity": 300,
                    "unit": "Grams"
                },
                {
                    "name":"Whole-Wheat Flour",
                    "quantity":35,
                    "unit":"Grams"
                }, 
                {
                    "name":"Instant Yeast",
                    "quantity": 1.5,
                    "unit":"tsp"
                },
                {
                    "name":"Salt",
                    "quantity": 1,
                    "unit":"tsp"
                },
                {
                    "name":"Sugar",
                    "quantity": 0.5,
                    "unit": "tsp"
                },
                {
                    "name":"Olive Oil",
                    "quantity":2,
                    "unit":"tbsp"
                },
                {
                    "name":"Water",
                    "quantity": 240,
                    "unit":"mL"
                }
            ],
            "instructions": [
                "Prepare warm water (bring 1\/3 of your water to a boil and mix with remaining water)",
                "Add yeast and sugar to water and let sit for 15 minutes in a warm place",
                "Combine the mixture with all the whole-wheat flour, all-purpose flour, olive oil and salt",
                "Mix with a wooden spoon until a shaggy mass, then knead in the bowl for 1 minute",
                "Once most of the stray bits have been incorperated, turn dough out onto work surface and knead lightly for 2 minutes",
                "Once the dough forms a smooth surface, let it rest for 10 minutes and knead again for 2 minutes",
                "Get a clean mixing bowl and place the dough inside, covering with either plastic wrap or a towel",
                "Wait 1-2hrs for the dough to double in size, this step varies depending on temperature and flour used",
                "At this point we want to preheat our vessel... Preheat your oven at 475°F with a baking tray or cast iron pan (or cook on a hot stove top)",
                "Punch your dough in the mouth and split it into roughly 80g balls, be sure to flour your work surface before rolling out into 6in discs",
                "Place the discs on the vessel swiftly but carefuly and place in the oven for 2 minutes, we are looking for a nice puff",
                "Turn over to the other side and bake for one more minute, and place warm pita in a towel to absorb the moisture and to stay soft",
                "Enjoy my friends 🙃"
                

            ],
            "SpecialNotes":"Hey this note is very special",
            "photoThumbnail": "recipePhotos/PitaThumbnailRev.jpg",
            "photoHeader":"recipePhotos/PitaHeaderRev1.jpg"
        },
        {
            "name":"Semi-Sweat Corn Bread",
            "serving":{
                "quantity": 1,
                "size": 10,
                "unit":"Inch",
                "type": "Cast-Iron Loaf"
            },
            "description":"You may ask how did corn bread end up here?? <br> In 2014 I had the pleasure of visiting NOLA ⚜️<br> This was the one that I couldnt let get away... <br> It goes great with any sort of hearty BBQ 🍖<br> Make sure to eat it while is warm, so reheat it!<br> My favourite way is with some honey & butter.<br> 😋😋😋 ",
            "ingredients":[
                {
                    "name":"Buttermilk",
                    "quantity":1.5,
                    "unit":"Cups"
                },
                {
                    "name":"Eggs",
                    "quantity":2,
                    "unit":"Large"
                },
                {
                    "name":"Butter",
                    "quantity":0.5,
                    "unit":"Cups"
                },
                {
                    "name":"Honey",
                    "quantity":3.5,
                    "unit":"tbsp"
                },
                {
                    "name":"Cornmeal",
                    "quantity":1,
                    "unit":"Cups"
                },
                {
                    "name":"All-purpose Flour",
                    "quantity":1,
                    "unit":"Cups"
                },
                {
                    "name":"Baking Powder",
                    "quantity":0.5,
                    "unit":"tsp"
                },
                {
                    "name":"Baking Soda",
                    "quantity":0.5,
                    "unit":"tsp"
                },                
                {
                    "name":"Salt",
                    "quantity":1,
                    "unit":"tsp"
                }
                
            ], 
            "instructions":[
                "Preheat the oven to 425°F and melt down the butter in your skillet",
                "Whisk all your dry then wet ingredients in seperate bowls",
                "Whisk roughly half the <strong>cooled down</strong> butter into the wet ingredients",
                "Slowly and gently fold the dry ingredients into the wet ingredients",
                "Place the batter into the skillet with the remaining butter",
                "Place the skillet in the pre-heated oven and wait about 23 minutes",
                "When you suspect its done, insert a toothpick into the center.<br>If it comes out clean with nothing stuck to it, it is ready!",
                "Let it cool for 10 minutes on a baking rack or in the pan.",
                "Tradition is to always add some extra butter on top. 😎"
            ],
            "SpecialNotes":"Hey this note is very special",
            "photoThumbnail":"recipePhotos/CornBreadThumbnail.jpg",
            "photoHeader":"recipePhotos/CornBreadHeaderRev1.jpg"
       },
       {
        "name":"Delicious Chili Spread",
        "serving":{
            "quantity": 4,
            "size":"",
            "unit":"Cups",
            "type": "Chili Paste"
        },
        "description": "I was on a 2-year hunt for a spicy paste... 🧐<br>And I have found one that meets my needs💁‍♂️<br>Great blend of spice, acidity and richness.<br>The mild sweetness from the bell peppers 👌<br>Enjoy this on top of plain bread, eggs or meat!<br>Bottled chili paste will never be the same 🙏 <br> Recipe credits go to Chef John!",
        "ingredients": [
            {
                "name" : "Sweet Bell Peppers",
                "quantity" : 0.5,
                "unit" : "Kg"
            },
            {
                "name" : "Scotch Bonnet Peppers",
                "quantity" : 100,
                "unit" : "Grams"
            },
            {
                "name" : "Egg Plant",
                "quantity" : 1,
                "unit" : "Small"
            },
            {
                "name" : "Button Mushrooms",
                "quantity" : 4,
                "unit" : "Medium"
            },
            {
                "name" : "Yellow Onion",
                "quantity" : 0.5,
                "unit" : "Medium"
            },
            {
                "name" : "Olive Oil",
                "quantity" : 1,
                "unit" : "Cups"
            },
            {
                "name" : "White Wine Vinegar",
                "quantity" : 0.25,
                "unit" : "Cups"
            },
            {
                "name" : "Salt",
                "quantity" : 3,
                "unit" : "tsp"
            },
            {
                "name" : "Fennel Seeds",
                "quantity" : 0.5,
                "unit" : "tsp"
            },
            {
                "name" : "Oregano",
                "quantity" : 1,
                "unit" : "tsp"
            }
        ],
        "instructions":[
            "Using a food food processer, lightly pulse (10 pulses) the chopped onion, mushrooms and eggplant.",
            "Drizzle some olive oil into a large pan and transfer the contents over a medium-high heat. Add the salt and cook until the mixture is soft (10 min).",
            "<strong>While wearing gloves in a well ventilated space:</strong> Cut the tops off the hot and sweet peppers and clean the seeds. Discard the stems but save the rings.",
            "Using a food processor, lightly pulse (10 pulses) the new mixture and combine in the skillet. Add the remaining olive oil, <strong>crushed</strong> fennel seeds, and oregano.",
            "Stir occasionally and if the mixture is browning, reduce the heat. Cook for 20-30 minutes or until peppers are tender.",
            "Stir in the white wine vinegar and transfer to a mixing bowl. Taste for any extra olive oil, salt or vinegar.",
            "Enjoy! For next time - feel free to try out different hot peppers, just be cautious 🤯🥵🥴"
        ],
        "SpecialNotes":"Hey this note is very special",
        "photoThumbnail": "recipePhotos/ChiliPasteThumbnail.jpg",
        "photoHeader": "recipePhotos/ChiliPasteHeader.jpg"
        },
        {
            "name":"Whole Wheat Sourdough Loaf",
            "serving":{
                "quantity": 2,
                "size":"",
                "unit":"",
                "type": "Sourdough Loaves"
            },
            "description": "Would you believe that this dough took me 2 months?<br> So Sourdough is basically 'home-made yeast'... <br>It has its great health benefits, but the taste tough 🤤😋<br>I wont lie, it is a tricky recipe, but such worth lol.<br>Tangy and chewy on the insides but with a crunch!<br>My University roomate put me on SD, 3 years ago...<br>If this is new, go to your locally bakery and get a taste! <br> If you enjoy it, ask them for some SD starter 😛😁",
            "ingredients": [
                {
                    "name" : "Whole Wheat Flour",
                    "quantity" : 800,
                    "unit" : "Grams"
                },
                {
                    "name" : "Rye Flour",
                    "quantity" : 100,
                    "unit" : "Grams"
                },
                {
                    "name" : "All-Purpose Flour",
                    "quantity" : 100,
                    "unit" : "Grams"
                },
                {
                    "name" : "Water",
                    "quantity" : 780,
                    "unit" : "Grams"
                },
                {
                    "name" : "Levain",
                    "quantity" : 210,
                    "unit" : "Grams"
                },
                {
                    "name" : "Salt",
                    "quantity" : 20,
                    "unit" : "Grams"
                }
            ],
            "levain":[
                {
                    "name" : "Mature Sourdough Starter",
                    "quantity" : 50,
                    "unit" : "Grams" 
                },
                {
                    "name" : "Bread Flour",
                    "quantity" : 50,
                    "unit" : "Grams"
                },
                {
                    "name" : "Whole Wheat Flour",
                    "quantity" : 50,
                    "unit" : "Grams"
                },
                {
                    "name" : "Warm Water",
                    "quantity" : 100,
                    "unit" : "Grams"
                }
            ],
            "instructions":[
                "Combine Levain ingredients, mix with a fork until well incorporated, cover with a lid and leave in a warm place until doubled in size (~4hrs).",
                "In a large bowl, dissolve the Levain in about 80% of the water and add in the remaining ingredients, except for the salt. ",
                "Squeeze the mixture (do not rip) until a shaggy dough and slowly(5-10min) squeeze in most of the remaining water and let rest for 20min.",
                "Mix the salt with the remaining water and squeeze into the dough(5 min) - At this point the dough should have a smooth-ish surface.",
                "Transfer the dough into a lightly oiled clean bowl and let it rest for 30min.",
                "With wet hands, gently stretch/fold 4 sides of the dough into itself, flip over, cover and let rest for 30min.",
                "Repeat the previous step 2 more times - making sure you are not tearing the dough.",
                "Cover the dough and let it ferment at room temperature for 4hrs.",
                "Place the dough on a well floured work surface, divide into the suggested quantity and shape each piece into a tight ball (use a bench scraper here).",
                "Transfer the dough into a proofing container(bowl/banneton) and let it sit for 30min. Then cover each with a plastic bag and refrigerate for 8-12hrs.",
                "Place your baking vessel(dutch oven) in the oven and preheat it to 500°F (30min).",
                "<strong>Carefully:</strong> transfer the bread into the baking vessel(score the bread here if you'd like), add the cover and bake for 10min.",
                "Reduce the temperature to 475°F and bake for 15min.",
                "Uncover and let the steam out, transfer the bread to the top rack and bake for 15-20 minutes.",
                "Place the bread on a cooling rack for 20min - this ensures the insides are cooked thoroughly!"
            ],
            "SpecialNotes":"Hey this note is very special",
            "photoThumbnail": "recipePhotos/wwDoughThumbnail.jpg",
            "photoHeader": "recipePhotos/wwSourDoughHeader.jpg"
            },
            {
                "name":"Country Style Sourdough Loaf",
                "serving":{
                    "quantity": 2,
                    "size":"",
                    "unit":"",
                    "type": "Sourdough Loaves"
                },
                "description": "Main Ingredient here is a high protein Bread Flour<br>Would you believe that this dough took me 2 months?<br> So Sourdough is basically 'home-made yeast'... <br>It has its great health benefits, but the taste tough 🤤😋<br>I wont lie, it is a tricky recipe, but such worth lol.<br>Tangy and chewy on the insides but with a crunch!<br>My University roomate put me on SD, 3 years ago...<br>If this is new, go to your locally bakery and get a taste! <br> If you enjoy it, ask them for some SD starter 😛😁",
                "ingredients": [
                    {
                        "name" : "Strong Bread Flour",
                        "quantity" : 600,
                        "unit" : "Grams"
                    },
                    {
                        "name" : "Whole Wheat Flour",
                        "quantity" : 100,
                        "unit" : "Grams"
                    },
                    {
                        "name" : "All-Purpose Flour",
                        "quantity" : 300,
                        "unit" : "Grams"
                    },
                    {
                        "name" : "Water",
                        "quantity" : 730,
                        "unit" : "Grams"
                    },
                    {
                        "name" : "Levain",
                        "quantity" : 200,
                        "unit" : "Grams"
                    },
                    {
                        "name" : "Salt",
                        "quantity" : 20,
                        "unit" : "Grams"
                    }
                ],
                "levain":[
                    {
                        "name" : "Mature Sourdough Starter",
                        "quantity" : 50,
                        "unit" : "Grams" 
                    },
                    {
                        "name" : "Bread Flour",
                        "quantity" : 50,
                        "unit" : "Grams"
                    },
                    {
                        "name" : "Whole Wheat Flour",
                        "quantity" : 50,
                        "unit" : "Grams"
                    },
                    {
                        "name" : "Warm Water",
                        "quantity" : 100,
                        "unit" : "Grams"
                    }
                ],
                "instructions":[
                    "Combine Levain ingredients, mix with a fork until well incorporated, cover with a lid and leave in a warm place until doubled in size (~4hrs).",
                    "In a large bowl, dissolve the Levain in about 80% of the water and add in the remaining ingredients, except for the salt. ",
                    "Squeeze the mixture (do not rip) until a shaggy dough and slowly(5-10min) squeeze in most of the remaining water and let rest for 20min.",
                    "Mix the salt with the remaining water and squeeze into the dough(5 min) - At this point the dough should have a smooth-ish surface.",
                    "Transfer the dough into a lightly oiled clean bowl and let it rest for 30min.",
                    "With wet hands, gently stretch/fold 4 sides of the dough into itself, flip over, cover and let rest for 30min.",
                    "Repeat the previous step 1 more time - making sure you are not tearing the dough.",
                    "Cover the dough and let it ferment at room temperature for 4hrs.",
                    "Place the dough on a well floured work surface, divide into the suggested quantity and shape each piece into a tight ball (use a bench scraper here).",
                    "Transfer the dough into a proofing container(bowl/banneton) and let it sit for 30min. Then cover each with a plastic bag and refrigerate for 8-12hrs.",
                    "Place your baking vessel(dutch oven) in the oven and preheat it to 500°F (30min).",
                    "<strong>Carefully:</strong> transfer the bread into the baking vessel(score the bread here if you'd like), add the cover and bake for 10min.",
                    "Reduce the temperature to 475°F and bake for 15min.",
                    "Uncover and let the steam out, transfer the bread to the top rack and bake for 15-20 minutes.",
                    "Place the bread on a cooling rack for 20min - this ensures the insides are cooked thoroughly!"
                ],
                "SpecialNotes":"Hey this note is very special",
                "photoThumbnail": "recipePhotos/SourDoughThumbnailRev1.jpg",
                "photoHeader": "recipePhotos/SourDoughHeader.jpg"
                },
                {
                    "name":"Classic Italian Pizza Sauce",
                    "serving":{
                        "quantity": 3,
                        "size":"",
                        "unit":"Cups",
                        "type": "Pizza Sauce"
                    },
                    "description": "Credits go to Alba Fera fo this one. <br> Increase the quantity and store in mason jars.<br>Goes great on top of pizza or pasta. <br> I would recommend having some extra bread for dipping with the sauce!",
                    "ingredients": [
                        {
                            "name" : "Whole Tomatoes Canned",
                            "quantity" : 1,
                            "unit" : "Cans"
                        },
                        {
                            "name" : "Strained tomatoes",
                            "quantity" : 2,
                            "unit" : "Jars"
                        },
                        {
                            "name" : "Garlic",
                            "quantity" : 5,
                            "unit" : "Cloves"
                        },
                        {
                            "name" : "White or Yellow Onion",
                            "quantity" : 0.5,
                            "unit" : "Medium Size"
                        },
                        {
                            "name" : "Tomatoe Paste",
                            "quantity" : 0.5,
                            "unit" : "Cans"
                        },
                        {
                            "name" : "Olive Oil",
                            "quantity" : 3,
                            "unit" : "Tbsp"
                        },
                        {
                            "name" : "Salt",
                            "quantity" : 5,
                            "unit" : "Grams"
                        },
                        {
                            "name" : "Ground Black Pepper",
                            "quantity" : 3,
                            "unit" : "Grams"
                        },
                        {
                            "name" : "Red Pepper Flakes",
                            "quantity" : 1,
                            "unit" : "Tbsp"
                        },
                        {
                            "name" : "Dried Basil",
                            "quantity" : 1,
                            "unit" : "Tsp"
                        },
                        {
                            "name" : "Fresh Oregano",
                            "quantity" : 2,
                            "unit" : "Tbsp"
                        }
                    ],
                    "instructions":[
                        "Sautee Onion and Garlic - Do not brown the garlic!",
                        "Add in Fresh Oregano, Red Pepper Flakes, Dried Basil, Black Pepper and tomatoe paste.",
                        "Sautee until fragrant. Then add in the strained tomatoes and whole tomatoes.",
                        "Bring to a boil, reduce and let simmer for 2.5 - 3hrs. Stir Occasionally",
                        "Goes great on pizza or with pasta. Considering puree version with a blender if preffered."
                    ],
                    "SpecialNotes":"Hey this note is very special",
                    "photoThumbnail": "recipePhotos/PizzaSauceThumbnail.jpg",
                    "photoHeader": "recipePhotos/PizzaSauceHeader.jpg"
                    }
                
    ]
}